## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 1 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                     NAME                                     |
|----------|------------------------------------------------------------------------------|
| update   | `aws_ssm_parameter.docdb_uri`                                                |
| recreate | `aws_docdb_cluster.ai-answers-docdb-cluster`                                 |
|          | `aws_docdb_cluster_instance.ai-answers-docdb-instance[0]`                    |
|          | `aws_docdb_cluster_parameter_group.ai-answers-docdb-cluster-parameter-group` |
|          | `aws_docdb_subnet_group.ai-answers-docdb-subnet-group`                       |
|          | `aws_security_group.ai-answers-docdb-sg`                                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_docdb_cluster.ai-answers-docdb-cluster must be replaced
-/+ resource "aws_docdb_cluster" "ai-answers-docdb-cluster" {
      ~ arn                             = "arn:aws:rds:ca-central-1:992382783569:cluster:ai-answers-docdb-cluster" -> (known after apply)
      ~ availability_zones              = [
          - "ca-central-1a",
          - "ca-central-1b",
          - "ca-central-1d",
        ] -> (known after apply)
      ~ cluster_identifier              = "ai-answers-docdb-cluster" -> "ai-answers-staging-docdb-cluster" # forces replacement
      + cluster_identifier_prefix       = (known after apply)
      ~ cluster_members                 = [
          - "ai-answers-docdb-instance",
        ] -> (known after apply)
      ~ cluster_resource_id             = "cluster-CLCWDC7DL4HG3EAQEYHFGVWTXA" -> (known after apply)
      ~ db_cluster_parameter_group_name = "ai-asnwers-docdb-cluster-parameter-group" -> "ai-answers-staging-docdb-cluster-parameter-group"
      ~ db_subnet_group_name            = "ai-answers-example-docdb-subnet-group" -> "ai-answers-staging-docdb-subnet-group" # forces replacement
      - deletion_protection             = false -> null
      - enabled_cloudwatch_logs_exports = [] -> null
      ~ endpoint                        = "ai-answers-docdb-cluster.cluster-c52kwceay79r.ca-central-1.docdb.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id                  = "Z13BE05W0CBKTH" -> (known after apply)
      ~ id                              = "ai-answers-docdb-cluster" -> (known after apply)
      ~ kms_key_id                      = "arn:aws:kms:ca-central-1:992382783569:key/6e7e18d6-9977-4952-833a-1ab88280e9c3" -> (known after apply)
      ~ preferred_backup_window         = "04:01-04:31" -> (known after apply)
      ~ preferred_maintenance_window    = "thu:09:47-thu:10:17" -> (known after apply)
      ~ reader_endpoint                 = "ai-answers-docdb-cluster.cluster-ro-c52kwceay79r.ca-central-1.docdb.amazonaws.com" -> (known after apply)
        tags                            = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
      ~ vpc_security_group_ids          = [
          - "sg-04966047bf236b850",
        ] -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_docdb_cluster_instance.ai-answers-docdb-instance[0] must be replaced
-/+ resource "aws_docdb_cluster_instance" "ai-answers-docdb-instance" {
      ~ arn                             = "arn:aws:rds:ca-central-1:992382783569:db:ai-answers-docdb-instance" -> (known after apply)
      ~ availability_zone               = "ca-central-1b" -> (known after apply)
      ~ ca_cert_identifier              = "rds-ca-rsa2048-g1" -> (known after apply)
      ~ cluster_identifier              = "ai-answers-docdb-cluster" -> (known after apply) # forces replacement
      - copy_tags_to_snapshot           = false -> null
      ~ db_subnet_group_name            = "ai-answers-example-docdb-subnet-group" -> (known after apply)
      ~ dbi_resource_id                 = "db-SX2VLP4OGMPJMDHBHKL5YQIN4M" -> (known after apply)
      ~ endpoint                        = "ai-answers-docdb-instance.c52kwceay79r.ca-central-1.docdb.amazonaws.com" -> (known after apply)
      ~ engine_version                  = "5.0.0" -> (known after apply)
      ~ id                              = "ai-answers-docdb-instance" -> (known after apply)
      ~ identifier                      = "ai-answers-docdb-instance" -> "ai-answers-staging-docdb-instance-1" # forces replacement
      + identifier_prefix               = (known after apply)
      ~ kms_key_id                      = "arn:aws:kms:ca-central-1:992382783569:key/6e7e18d6-9977-4952-833a-1ab88280e9c3" -> (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      ~ port                            = 27017 -> (known after apply)
      ~ preferred_backup_window         = "04:01-04:31" -> (known after apply)
      ~ preferred_maintenance_window    = "sat:08:59-sat:09:29" -> (known after apply)
      ~ publicly_accessible             = false -> (known after apply)
      ~ storage_encrypted               = true -> (known after apply)
        tags                            = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
      ~ writer                          = true -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_docdb_cluster_parameter_group.ai-answers-docdb-cluster-parameter-group must be replaced
-/+ resource "aws_docdb_cluster_parameter_group" "ai-answers-docdb-cluster-parameter-group" {
      ~ arn         = "arn:aws:rds:ca-central-1:992382783569:cluster-pg:ai-asnwers-docdb-cluster-parameter-group" -> (known after apply)
      ~ description = "Parameter group for DocumentDB" -> "Parameter group for ai-answers staging DocumentDB" # forces replacement
      ~ id          = "ai-asnwers-docdb-cluster-parameter-group" -> (known after apply)
      ~ name        = "ai-asnwers-docdb-cluster-parameter-group" -> "ai-answers-staging-docdb-cluster-parameter-group" # forces replacement
      + name_prefix = (known after apply)
        tags        = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_docdb_subnet_group.ai-answers-docdb-subnet-group must be replaced
-/+ resource "aws_docdb_subnet_group" "ai-answers-docdb-subnet-group" {
      ~ arn         = "arn:aws:rds:ca-central-1:992382783569:subgrp:ai-answers-example-docdb-subnet-group" -> (known after apply)
      ~ description = "Subnet group for DocumentDB for the AI Answers app" -> "Subnet group for DocumentDB for the ai-answers staging app"
      ~ id          = "ai-answers-example-docdb-subnet-group" -> (known after apply)
      ~ name        = "ai-answers-example-docdb-subnet-group" -> "ai-answers-staging-docdb-subnet-group" # forces replacement
      + name_prefix = (known after apply)
        tags        = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_security_group.ai-answers-docdb-sg must be replaced
-/+ resource "aws_security_group" "ai-answers-docdb-sg" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:992382783569:security-group/sg-04966047bf236b850" -> (known after apply)
      ~ description            = "Security group for DocumentDB for the AI Answers app" -> "Security group for DocumentDB for the ai-answers staging app" # forces replacement
      ~ id                     = "sg-04966047bf236b850" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow DocumentDB cluster to receive requests from ECS"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-085c606383f33733e",
                ]
              - self             = false
              - to_port          = 27017
            },
            # (1 unchanged element hidden)
        ]
      ~ name                   = "ai-answers-example-docdb-sg" -> "ai-answers-staging-docdb-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "992382783569" -> (known after apply)
        tags                   = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_ssm_parameter.docdb_uri will be updated in-place
  ~ resource "aws_ssm_parameter" "docdb_uri" {
        id              = "docdb_uri"
      + insecure_value  = (known after apply)
        name            = "docdb_uri"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 2 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 5 to destroy.

Changes to Outputs:
  ~ aws_docdb_cluster_arn       = "arn:aws:rds:ca-central-1:992382783569:cluster:ai-answers-docdb-cluster" -> (known after apply)
  ~ aws_docdb_cluster_id        = "ai-answers-docdb-cluster" -> (known after apply)
  ~ aws_docdb_security_group_id = "sg-04966047bf236b850" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.docdb_uri"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
